{
  "main": {
    "name":"Ali Darwiche",
    "occupation":"<occupation>",
    "description":"Here will be your description. Use this to describe what you do or whatever you feel best describes yourself to a potential employer",
    "image":"profilepic.jpg",
    "linkedinpic":"linkedin-pic.jpg",
    "bio":"I would be lying to myself if I called this album anything less than my magnum opus. ‘Appreciate Everything’ is the culmination of 10 years of work, suffering, and studying in an attempt to create a body of art that fully portrays the diverse nature and expressions of my emotions. To me, these aren’t songs. They are chapters in my history. They are the unspoken narratives from the past 27 years of my life. That being said, these songs aren’t meant for everyone. They are radical and excessive. And in all honesty, they are *hella* overdramatic and way over the top most of the time… However, they are 100% authentic to how I feel inside, and if that overwhelms you, then it means I’ve definitely done my job right... In short, I hope 45-minutes of walking in my shoes can show you all what it means to wake up every day and say 'Hi, my name is Ali Darwiche.'",
    "contactmessage":"Wanna connect? Send me a message!",
    "email": "whenknightssang@gmail.com",
    "phone": "",
    "address":{
      "street":"",
      "city":"Austin",
      "state":"TX",
      "zip": ""
    },
    "website": "http://www.alidarwiche.com",
    "resumedownload":"../../public/images/alidarwiche_resume.pdf",
    "social":[
      {
        "name":"spotify",
        "url":"https://open.spotify.com/artist/4oNzjlGFRm47LMhqrnyncF?si=thUmuvRUT0Oadtc22T5fqA&dl_branch=1",
        "className":"fa fa-music"
      },
      {
        "name":"youtube",
        "url":"https://www.youtube.com/channel/UC1It-ctEcyfmoisW2rQFt-w",
        "className":"fa fa-youtube"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/profpunk",
        "className":"fa fa-instagram"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/profpunkmusic",
        "className":"fa fa-twitter"
      }
    ]
  },
  "resume":{
    "skillmessage":"The past year I have spent most of my time working in Python, jQuery, HTML, CSS, and Javascript. All my current development is in React.js as I work to expand my Frontend ability even further.",
    "education":[
      {
        "school":"The University of Texas at Austin",
        "degree":"Bachelor of Science and Arts",
        "graduated":"August 2017",
        "description":"I entered UT Austin as a undeclared major August 2012. I had no idea what I wanted to do with my life, but I knew I wanted it to involve three things: Creativity, Leadership, and Technology. I spent the next five years dedicating my studies to growing under those three pillars."
      },
      {
        "school":"College of Natural Sciences",
        "degree":"Major",
        "graduated":"Computer Science",
        "description":"After working in industry for the past year, I've found that the true value of my Computer Science degree came in the diversity of my studies and the foundation it gave me to grow. I distinctly remember solving my first task at The Home Depot using my knowledge of floating-point arithmetic gained from an Operating Systems course. With other courses such as Data Structures, Computer Architerures, Web & Mobile Application Development, and Intro to Security, it's hard not to value my time studying under UT's Computer Science department. Whether it be exploring authentication through oAuth and JWT tokens or discussing API contracts that follow RESTful practices, I find myself constantly in touch with those initial lectures introducing me to these every day topics."
      },
      {
        "school":"McCombs School of Business",
        "degree":"Minor",
        "graduated":"Business Management",
        "description":"I had two clear goals with my business studies: understanding the plumbing that makes a business work (from the accounting to providing customer value), and exploring how leadership can impact company culture and cultivate success. I found myself most engaged with courses that allowed me to practice oral and written communication or exploring topics of marketing, management, and entrepreneurship. I value my time in this program as it has helped me understand how business infrastructure and innovative technologies can work together to support a customer’s needs."
      },
      {
        "school":"College of Liberal Arts",
        "degree":"Minor",
        "graduated":"Honors Creative Writing",
        "description":"I tend to have the most fun explaining the value of Creative Writing to my life. To me, Creative Writing is a study of how our brain produces thought. When I write a new poem, its an opportunity to get in touch with my subconscious and then explore how my brain makes decisions or connections to create meaning. The editing processes isn’t just the process of improving a poem, but a chance to analyze the connections my brain had made and question why it did so. Overall, Creative Writing to me is a way to challenge my self-awareness and explore new ways of thinking either through editing or reading the work of other writers."
      }
    ],
    "work":[
      {
        "company":"The Home Depot",
        "title":"Full Stack Software Engineer",
        "years":"September 2017 - August 2018",
        "description": [
          "My time with The Home Depot is where I’ve found the most growth as a Software Engineer. While on the Performance Engineering team, I've developed tools to support Site Reliability Engineers as they monitor and improve The Home Depot’s site health. Our team of three engineers developed from scratch an incidents and changes tracking tool using Python with Flask for the backend and Javascript with jQuery for our frontend. My tasks ranged from implementing automation for Site Availability calculations to frontend development of tabular metrics. As the primary frontend developer of the application, I was tasked with implementing Request For Change and Blameless Postmortem form submissions which included auto-populate, typeahead, validation, session storage, and cloning functionality.",
          "I’ve also contributed to the Frontend ReactJS rewrite of our Reliability Engineering Hub. This application includes multiple dashboards each displaying unique metrics regarding The Home Depot orders and site health. For this rewrite, I handled the initial UX research on our older application. This involved conducting direct interviews with our primary customers, studying our Google Analytics, as well as completing a Card Sort study for our new navigation. During development, I was tasked with handling the rewrite of 7 out of 22 different pages requiring the use of table, graph, and pie chart components.",
          "Being on this team has come with incredible opportunities. I’ve worked intimately with our UX team to design new and old pages, I’ve paired with both Senior Frontend and Backend Engineers to implement features, and even had the “luxury” of handling emergency hotfixes to resolve production issues ranging from database failures to session caching problems involving Kubernetes clusters. It has been a rollercoaster of opportunity and growth that I truly appreciate."
        ]
      },
      {
        "company":"Homies.io",
        "title":"Web Development Intern",
        "years":"July 2017 - August 2017",
        "description":"Working with a team of three developers, I contributed to the backend of a Python-Flask application for a real estate website. Features included map navigation, real estate agent portals, and customer profile functionality. As a part-time intern, I was tasked with implementing basic REST routes and handling API documentation for our Frontend team using Apiary.io."
      },
      {
        "company":"Union Pacific Railroad",
        "title":"IT Intern",
        "years":"May 2016 - January 2017",
        "description":"While at Union Pacific Railroad, I contributed to web applications used by railroad personnel handling industrial hazards and environmental issue occuring on-site. I worked with a team of 10 developers and completed tasks ranging from frontend enhancements to quality assurance. My largest contribution to the application involved writing code to retrieve documents from a 3rd party database using Java, Spring MVC, SQL, and jUnit."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"70%"
      },
      {
        "name":"Javascript",
        "level":"60%"
      },
      {
        "name":"jQuery",
        "level":"65%"
      },
      {
        "name":"HTML",
        "level":"80%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"Bootstrap",
        "level":"80%"
      },
      {
        "name":"ReactJs",
        "level":"45%"
      },
      {
        "name":"Python",
        "level":"80%"
      },
      {
        "name":"Flask",
        "level":"60%"
      },
      {
        "name":"Java",
        "level":"60%"
      },
      {
        "name":"Swift",
        "level":"30%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Sweet Outdoors",
        "category":"A Python-Flask web application for discovering parks and recreational events in your area.",
        "image":"sweetoutdoors.jpg",
        "url":"https://github.com/cs373gc-fall-2016/SWEetOutdoors"
      },
      {
        "title":"PROcrastinator",
        "category":"An task management iOS application designed to help procrastinators prioritize their work.",
        "image":"procrastinator.jpg",
        "url":"https://github.com/asaidalaoui/IOS"
      },
      {
        "title":"Alarming",
        "category":"An alarm clock application for Android where the user must complete a task in order to disable their alarm.",
        "image":"alarming.jpg",
        "url":"https://github.com/lock14/alarming"
      },
      {
        "title":"alidarwiche.com v1.0",
        "category":"Version 1 of alidarwiche.com. A primarily HTML, CSS, Bootstrap application.",
        "image":"alidarwiche_v1.png",
        "url":"https://github.com/alidarwiche/alidarwiche.com-1"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"To me, these aren’t songs. They are chapters in my history. They are the unspoken narratives from the past 27 years of my life. That being said, these songs aren’t meant for everyone. They are radical and excessive. And in all honesty... they are *hella* overdramatic and way over the top most of the time... However! These tracks are 100% authentic to how I feel inside, and if that overwhelms you, then it means I’ve definitely done my job right."
      },
      {
        "text":"In short, I hope 45-minutes of walking in my shoes can show you all what it means to wake up every day and say 'Hi, my name is Ali Darwiche.'",
        "user":"Ali D."
      }
    ]
  },
  "videos": {
    "videos":[
      {
        "title":"I Don't Sing",
        "id":"SDyGAPnQgo4"
      }
    ]
  }
}
